[Killed] Block removal mutation
Controllers/OrderController.cs:15:5
     private readonly IRequestOrderService _requestOrderService;
 
     public OrderController(IRequestOrderService requestOrderService)
-    {
-        _requestOrderService = requestOrderService;
-    }
+    {}
 
     [HttpPost("buy")]
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy

[Killed] Negate expression
Controllers/OrderController.cs:24:13
     {
         var result = await _requestOrderService.CreateAsync(createOrder, TypeOrder.Buy, cancellationToken);
 
-        if (result.IsSuccess)
+        if (!(result.IsSuccess))
             return Ok(result.Value);
 
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy
