[Killed] Statement mutation
Startup.cs:19:9
 
     public override void ConfigureServices(IServiceCollection services)
     {
-        services.AddControllersWithViews();
+        ;
 
         services.AddCors(policyBuilder =>
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:21:9
     {
         services.AddControllersWithViews();
 
-        services.AddCors(policyBuilder =>
-            policyBuilder.AddDefaultPolicy(policy =>
-                policy.AllowAnyHeader().AllowAnyHeader())
-        );
+        ;
 
         base.ConfigureServices(services);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:26:9
                 policy.AllowAnyHeader().AllowAnyHeader())
         );
 
-        base.ConfigureServices(services);
+        ;
 
         services.AddSignalR();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:28:9
 
         base.ConfigureServices(services);
 
-        services.AddSignalR();
+        ;
 
         services.AddTransient<ClientWebSocket>();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:30:9
 
         services.AddSignalR();
 
-        services.AddTransient<ClientWebSocket>();
+        ;
         services.AddHostedService<BtcUsdOrderBookHostedService>();
         services.AddHostedService<EthUsdOrderBookHostedService>();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:31:9
         services.AddSignalR();
 
         services.AddTransient<ClientWebSocket>();
-        services.AddHostedService<BtcUsdOrderBookHostedService>();
+        ;
         services.AddHostedService<EthUsdOrderBookHostedService>();
         services.AddHostedService<WebSocketWorker>();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:32:9
 
         services.AddTransient<ClientWebSocket>();
         services.AddHostedService<BtcUsdOrderBookHostedService>();
-        services.AddHostedService<EthUsdOrderBookHostedService>();
+        ;
         services.AddHostedService<WebSocketWorker>();
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:33:9
         services.AddTransient<ClientWebSocket>();
         services.AddHostedService<BtcUsdOrderBookHostedService>();
         services.AddHostedService<EthUsdOrderBookHostedService>();
-        services.AddHostedService<WebSocketWorker>();
+        ;
     }
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:38:9
 
     public void Configure(IApplicationBuilder app, IWebHostEnvironment env)
     {
-        app.UseCors(builder => builder
-            .AllowAnyOrigin()
-            .AllowAnyMethod()
-            .AllowAnyHeader())
-            .UseMiddleware<CorrelationMiddleware>()
-            .UseMiddleware<LoggingMiddleware>();
+        ;
 
         // TODO: Isso é só para testes e apresentação, hambiente produtivo isso é contra indicado
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:46:9
             .UseMiddleware<LoggingMiddleware>();
 
         // TODO: Isso é só para testes e apresentação, hambiente produtivo isso é contra indicado
-        app.ExecuteMigartions();
+        ;
 
         app
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:48:9
         // TODO: Isso é só para testes e apresentação, hambiente produtivo isso é contra indicado
         app.ExecuteMigartions();
 
-        app
-            .UseStaticFiles()
-            .UseRouting()
-            .UseEndpoints(endpoints =>
-            {
-                endpoints.MapControllerRoute(name: "default", pattern: "{controller=Home}/{action=Index}/{id?}");
-                endpoints.MapControllers();
-                endpoints.MapHub<WebSocketHub>("/websocket");
-            });
+        ;
     }
 }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:53:17
             .UseRouting()
             .UseEndpoints(endpoints =>
             {
-                endpoints.MapControllerRoute(name: "default", pattern: "{controller=Home}/{action=Index}/{id?}");
+                ;
                 endpoints.MapControllers();
                 endpoints.MapHub<WebSocketHub>("/websocket");
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] String mutation
Startup.cs:53:72
             .UseRouting()
             .UseEndpoints(endpoints =>
             {
-                endpoints.MapControllerRoute(name: "default", pattern: "{controller=Home}/{action=Index}/{id?}");
+                endpoints.MapControllerRoute(name: "default", pattern: "");
                 endpoints.MapControllers();
                 endpoints.MapHub<WebSocketHub>("/websocket");
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:54:17
             .UseEndpoints(endpoints =>
             {
                 endpoints.MapControllerRoute(name: "default", pattern: "{controller=Home}/{action=Index}/{id?}");
-                endpoints.MapControllers();
+                ;
                 endpoints.MapHub<WebSocketHub>("/websocket");
             });
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Startup.cs:55:17
             {
                 endpoints.MapControllerRoute(name: "default", pattern: "{controller=Home}/{action=Index}/{id?}");
                 endpoints.MapControllers();
-                endpoints.MapHub<WebSocketHub>("/websocket");
+                ;
             });
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] String mutation
Startup.cs:55:48
             {
                 endpoints.MapControllerRoute(name: "default", pattern: "{controller=Home}/{action=Index}/{id?}");
                 endpoints.MapControllers();
-                endpoints.MapHub<WebSocketHub>("/websocket");
+                endpoints.MapHub<WebSocketHub>("");
             });
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
