[Killed] Block removal mutation
Controllers/HomeController.cs:8:9
     public class HomeController : Controller
     {
         public IActionResult Index()
-        {
-            return View();
-        }
+        {}
     }
 }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
