[NoCoverage] Statement mutation
WebSockets/WebSocketHub.cs:9:9
 {
     public override async Task OnConnectedAsync()
     {
-        await base.OnConnectedAsync();
+        ;
 
         // Opcional: realizar alguma ação quando um cliente se conectar
