[Killed] Block removal mutation
WebSockets/WebSocketWorker.cs:12:5
     private readonly ILogger<WebSocketWorker> _logger;
 
     public WebSocketWorker(IServiceProvider services, ILogger<WebSocketWorker> logger)
-    {
-        _services = services;
-        _logger = logger;
-    }
+    {}
 
     protected override async Task ExecuteAsync(CancellationToken stoppingToken)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
WebSockets/WebSocketWorker.cs:26:16
         var repoEthAsk = scope.ServiceProvider.GetRequiredService<IEthAskRepository>();
         var hubContext = scope.ServiceProvider.GetRequiredService<IHubContext<WebSocketHub>>();
 
-        while (!stoppingToken.IsCancellationRequested)
+        while (stoppingToken.IsCancellationRequested)
         {
             var btcBid = await repoBtcBid.GetMetrics(stoppingToken);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Statement mutation
WebSockets/WebSocketWorker.cs:40:13
                 EthBid = ethBid,
                 EthAsk = ethAsk,
             };
-            _logger.LogInformation("{@metrics}", produtos);
+            ;
 
             await hubContext.Clients.All.SendAsync("AtualizarProdutos", produtos);

[NoCoverage] String mutation
WebSockets/WebSocketWorker.cs:40:36
                 EthBid = ethBid,
                 EthAsk = ethAsk,
             };
-            _logger.LogInformation("{@metrics}", produtos);
+            _logger.LogInformation("", produtos);
 
             await hubContext.Clients.All.SendAsync("AtualizarProdutos", produtos);

[NoCoverage] Statement mutation
WebSockets/WebSocketWorker.cs:42:13
             };
             _logger.LogInformation("{@metrics}", produtos);
 
-            await hubContext.Clients.All.SendAsync("AtualizarProdutos", produtos);
+            ;
 
             await Task.Delay(TimeSpan.FromSeconds(5), stoppingToken);

[NoCoverage] Statement mutation
WebSockets/WebSocketWorker.cs:44:13
 
             await hubContext.Clients.All.SendAsync("AtualizarProdutos", produtos);
 
-            await Task.Delay(TimeSpan.FromSeconds(5), stoppingToken);
+            ;
         }
     }
