[Killed] Arithmetic mutation
Models/AggregationBook/BaseItemBook.cs:25:68
                 Price = decimal.Parse(x[0], System.Globalization.CultureInfo.InvariantCulture),
                 Microtimestamp = long.Parse(orderBook.Data.Microtimestamp),
                 Timestamp = long.Parse(orderBook.Data.Timestamp),
-                InsertAt = DateTimeOffset.FromUnixTimeMilliseconds(long.Parse(orderBook.Data.Microtimestamp) / 1000)
+                InsertAt = DateTimeOffset.FromUnixTimeMilliseconds(long.Parse(orderBook.Data.Microtimestamp) * 1000)
             }).ToList();
         }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Arithmetic mutation
Models/AggregationBook/BaseItemBook.cs:33:64
         {
             Timestamp = timestamp;
             Microtimestamp = microtimestamp;
-            InsertAt = DateTimeOffset.FromUnixTimeMilliseconds(microtimestamp / 1000);
+            InsertAt = DateTimeOffset.FromUnixTimeMilliseconds(microtimestamp * 1000);
 
             return (T)this;
