[Survived] Linq method mutation (Sum() to Max())
Models/AggregationOrder/Order.cs:20:17
         Crypto = crypto;
         Stock = stock;
         Type = type;
-        Price = Stock.Sum(x => x.Price);
+        Price = Stock.Max(x => x.Price);
         AmountTotal = Stock.Sum(x => x.Amount);
     }

[Survived] Linq method mutation (Sum() to Max())
Models/AggregationOrder/Order.cs:21:23
         Stock = stock;
         Type = type;
         Price = Stock.Sum(x => x.Price);
-        AmountTotal = Stock.Sum(x => x.Amount);
+        AmountTotal = Stock.Max(x => x.Amount);
     }
     public decimal Price { get; set; }
