[Killed] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Services/CorrelationContextService.cs:11:9
 
     public Guid GetCorrelationId()
     {
-        _correlationId ??= Guid.NewGuid();
+        _correlationId = Guid.NewGuid();
         return _correlationId.Value;
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Block removal mutation
Services/CorrelationContextService.cs:16:5
     }
 
     public void SetCorrelationId(Guid correlationId)
-    {
-        _correlationId = correlationId;
-    }
+    {}
 }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
