[Killed] Block removal mutation
Services/RepositoryFabric.cs:19:5
         IBtcBidRepository btcBidRepository,
         IEthAskRepository ethAskRepository,
         IEthBidRepository ethBidRepository)
-    {
-        _btcAskRepository = btcAskRepository;
-        _btcBidRepository = btcBidRepository;
-        _ethAskRepository = ethAskRepository;
-        _ethBidRepository = ethBidRepository;
-    }
+    {}
 
     public IBitstampRepository GetRepositoryToOrder(TypeOrder typeOrder, TypeCripto typeCripto)
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Sell

[Survived] Equality mutation
Services/RepositoryFabric.cs:30:30
     {
         return typeOrder switch
         {
-            TypeOrder.Buy => typeCripto == TypeCripto.BTC ? _btcAskRepository : _ethAskRepository,
+            TypeOrder.Buy => typeCripto != TypeCripto.BTC ? _btcAskRepository : _ethAskRepository,
             _ => typeCripto == TypeCripto.BTC ? _btcBidRepository : _ethBidRepository,
         };

[Survived] Equality mutation
Services/RepositoryFabric.cs:31:18
         return typeOrder switch
         {
             TypeOrder.Buy => typeCripto == TypeCripto.BTC ? _btcAskRepository : _ethAskRepository,
-            _ => typeCripto == TypeCripto.BTC ? _btcBidRepository : _ethBidRepository,
+            _ => typeCripto != TypeCripto.BTC ? _btcBidRepository : _ethBidRepository,
         };
     }
