[Killed] Block removal mutation
Services/RequestOrderService.cs:15:5
     private readonly ICorrelationContextService _correlation;
 
     public RequestOrderService(ICorrelationContextService correlation, IRepositoryFabric repositoryFabric)
-    {
-        _repositoryFabric = repositoryFabric;
-        _correlation = correlation;
-    }
+    {}
 
     public async Task<Result<Order>> CreateAsync(CreateOrder createOrder, TypeOrder typeOrder, CancellationToken cancellationToken)
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Sell

[Killed] Equality mutation
Services/RequestOrderService.cs:25:21
         var repo = _repositoryFabric.GetRepositoryToOrder(typeOrder, createOrder.TypeCripto);
         var list = await repo.ListItensBookToOrder(createOrder.Amount, cancellationToken);
 
-        if (list is null)
+        if (list is not null)
             return Result.Fail<Order>("Null", "Não encontrado valor na base");
 
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Sell

[Survived] Statement mutation
Services/RequestOrderService.cs:30:9
 
         var order = new Order(_correlation.GetCorrelationId(), createOrder.Amount, createOrder.TypeCripto, list.ToArray(), typeOrder);
 
-        await repo.SaveOrder(order, cancellationToken);
+        ;
 
         return Result.Ok(order);
