[Killed] Boolean mutation
Services/WebSockets/BitstampWebSocketService.cs:18:34
     private readonly CurrencyType _currencyType;
     private readonly CancellationToken _cancellationToken;
     private readonly Memory<byte> _buffer;
-    private bool disposedValue = false;
+    private bool disposedValue = true;
 
     private static readonly JsonSerializerOptions _jsonSerializerOptions = new()
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Boolean mutation
Services/WebSockets/BitstampWebSocketService.cs:22:39
 
     private static readonly JsonSerializerOptions _jsonSerializerOptions = new()
     {
-        PropertyNameCaseInsensitive = true
+        PropertyNameCaseInsensitive = false
     };
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Arithmetic mutation
Services/WebSockets/BitstampWebSocketService.cs:32:45
         _socket = clientWebSocket;
         _currencyType = currencyType;
         _cancellationToken = new CancellationToken();
-        _buffer = new Memory<byte>(new byte[4096 * 2]);
+        _buffer = new Memory<byte>(new byte[4096 / 2]);
     }
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:39:9
 
     public async Task ConnectAndListen()
     {
-        await _socket.ConnectAsync(new Uri(_wsUrl), _cancellationToken);
+        ;
 
         await SubscribeWebSocketMessage();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:41:9
     {
         await _socket.ConnectAsync(new Uri(_wsUrl), _cancellationToken);
 
-        await SubscribeWebSocketMessage();
+        ;
 
         while (_socket.State == WebSocketState.Open)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Equality mutation
Services/WebSockets/BitstampWebSocketService.cs:43:16
 
         await SubscribeWebSocketMessage();
 
-        while (_socket.State == WebSocketState.Open)
+        while (_socket.State != WebSocketState.Open)
         {
             await ReceiveMessage();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:45:13
 
         while (_socket.State == WebSocketState.Open)
         {
-            await ReceiveMessage();
+            ;
         }
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Boolean mutation
Services/WebSockets/BitstampWebSocketService.cs:53:111
     {
         var message = $"{{\"event\":\"bts:subscribe\",\"data\":{{\"channel\":\"order_book_{_currencyType}\"}}}}";
 
-        await _socket.SendAsync(new Memory<byte>(Encoding.UTF8.GetBytes(message)), WebSocketMessageType.Text, true, _cancellationToken);
+        await _socket.SendAsync(new Memory<byte>(Encoding.UTF8.GetBytes(message)), WebSocketMessageType.Text, false, _cancellationToken);
     }
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:53:9
     {
         var message = $"{{\"event\":\"bts:subscribe\",\"data\":{{\"channel\":\"order_book_{_currencyType}\"}}}}";
 
-        await _socket.SendAsync(new Memory<byte>(Encoding.UTF8.GetBytes(message)), WebSocketMessageType.Text, true, _cancellationToken);
+        ;
     }
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Equality mutation
Services/WebSockets/BitstampWebSocketService.cs:60:13
     {
         var result = await _socket.ReceiveAsync(_buffer, _cancellationToken);
 
-        if (result.MessageType != WebSocketMessageType.Text)
+        if (result.MessageType == WebSocketMessageType.Text)
             return;
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:61:13
         var result = await _socket.ReceiveAsync(_buffer, _cancellationToken);
 
         if (result.MessageType != WebSocketMessageType.Text)
-            return;
+            ;
 
         var message = Encoding.UTF8.GetString(_buffer.Span.Slice(0, result.Count));

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/WebSockets/BitstampWebSocketService.cs:64:13
             return;
 
         var message = Encoding.UTF8.GetString(_buffer.Span.Slice(0, result.Count));
-        if (!string.IsNullOrEmpty(message) && TryParse(message, out var resultJson) && resultJson!.Event == "data")
+        if (string.IsNullOrEmpty(message) && TryParse(message, out var resultJson) && resultJson!.Event == "data")
             await ExecuteOrderBook(resultJson, _cancellationToken);
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Equality mutation
Services/WebSockets/BitstampWebSocketService.cs:64:88
             return;
 
         var message = Encoding.UTF8.GetString(_buffer.Span.Slice(0, result.Count));
-        if (!string.IsNullOrEmpty(message) && TryParse(message, out var resultJson) && resultJson!.Event == "data")
+        if (!string.IsNullOrEmpty(message) && TryParse(message, out var resultJson) && resultJson!.Event != "data")
             await ExecuteOrderBook(resultJson, _cancellationToken);
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:65:13
 
         var message = Encoding.UTF8.GetString(_buffer.Span.Slice(0, result.Count));
         if (!string.IsNullOrEmpty(message) && TryParse(message, out var resultJson) && resultJson!.Event == "data")
-            await ExecuteOrderBook(resultJson, _cancellationToken);
+            ;
     }
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Equality mutation
Services/WebSockets/BitstampWebSocketService.cs:73:24
         try
         {
             var obj = JsonSerializer.Deserialize<OrderBook>(jsonString, _jsonSerializerOptions);
-            if (obj is null)
+            if (obj is not null)
             {
                 result = default;
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Boolean mutation
Services/WebSockets/BitstampWebSocketService.cs:76:24
             if (obj is null)
             {
                 result = default;
-                return false;
+                return true;
             }
             result = obj;

[Killed] Boolean mutation
Services/WebSockets/BitstampWebSocketService.cs:79:20
                 return false;
             }
             result = obj;
-            return true;
+            return false;
         }
         catch (JsonException)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/WebSockets/BitstampWebSocketService.cs:90:13
 
     protected virtual void Dispose(bool disposing)
     {
-        if (!disposedValue)
+        if (disposedValue)
         {
             if (disposing)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Negate expression
Services/WebSockets/BitstampWebSocketService.cs:92:17
     {
         if (!disposedValue)
         {
-            if (disposing)
+            if (!(disposing))
             {
                 _socket.Dispose();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:94:17
         {
             if (disposing)
             {
-                _socket.Dispose();
+                ;
             }
             disposedValue = true;
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Boolean mutation
Services/WebSockets/BitstampWebSocketService.cs:96:29
             {
                 _socket.Dispose();
             }
-            disposedValue = true;
+            disposedValue = false;
         }
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Boolean mutation
Services/WebSockets/BitstampWebSocketService.cs:102:28
 
     public void Dispose()
     {
-        Dispose(disposing: true);
+        Dispose(disposing: false);
         GC.SuppressFinalize(this);
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:102:9
 
     public void Dispose()
     {
-        Dispose(disposing: true);
+        ;
         GC.SuppressFinalize(this);
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BitstampWebSocketService.cs:103:9
     public void Dispose()
     {
         Dispose(disposing: true);
-        GC.SuppressFinalize(this);
+        ;
     }
 }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
