[Killed] String mutation
Services/WebSockets/BtcUsdOrderBookService.cs:17:62
 
     public BtcUsdOrderBookService(ILogger<BtcUsdOrderBookService> logger, ClientWebSocket clientWebSocket,
         IBtcAskRepository btcAskRepository, IBtcBidRepository btcBidRepository)
-        : base(logger, clientWebSocket, CurrencyType.btcusd, "wss://ws.bitstamp.net")
+        : base(logger, clientWebSocket, CurrencyType.btcusd, "")
     {
         _btcAskRepository = btcAskRepository;
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Block removal mutation
Services/WebSockets/BtcUsdOrderBookService.cs:18:5
     public BtcUsdOrderBookService(ILogger<BtcUsdOrderBookService> logger, ClientWebSocket clientWebSocket,
         IBtcAskRepository btcAskRepository, IBtcBidRepository btcBidRepository)
         : base(logger, clientWebSocket, CurrencyType.btcusd, "wss://ws.bitstamp.net")
-    {
-        _btcAskRepository = btcAskRepository;
-        _btcBidRepository = btcBidRepository;
-    }
+    {}
 
     public override async Task ExecuteOrderBook(OrderBook? message, CancellationToken cancellationToken = default)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/BtcUsdOrderBookService.cs:25:9
 
     public override async Task ExecuteOrderBook(OrderBook? message, CancellationToken cancellationToken = default)
     {
-        await _btcAskRepository.InsertOrUpdateRangeAsync(new BtcAsk().Convert(message!).ToList(), cancellationToken);
+        ;
         await _btcBidRepository.InsertOrUpdateRangeAsync(new BtcBid().Convert(message!).ToList(), cancellationToken);
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Statement mutation
Services/WebSockets/BtcUsdOrderBookService.cs:26:9
     public override async Task ExecuteOrderBook(OrderBook? message, CancellationToken cancellationToken = default)
     {
         await _btcAskRepository.InsertOrUpdateRangeAsync(new BtcAsk().Convert(message!).ToList(), cancellationToken);
-        await _btcBidRepository.InsertOrUpdateRangeAsync(new BtcBid().Convert(message!).ToList(), cancellationToken);
+        ;
     }
 }
