[Killed] String mutation
Services/WebSockets/EthUsdOrderBookService.cs:17:62
 
     public EthUsdOrderBookService(ILogger<EthUsdOrderBookService> logger, ClientWebSocket clientWebSocket,
         IEthAskRepository ethAskRepository, IEthBidRepository ethBidRepository)
-        : base(logger, clientWebSocket, CurrencyType.ethusd, "wss://ws.bitstamp.net")
+        : base(logger, clientWebSocket, CurrencyType.ethusd, "")
     {
         _ethAskRepository = ethAskRepository;
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Block removal mutation
Services/WebSockets/EthUsdOrderBookService.cs:18:5
     public EthUsdOrderBookService(ILogger<EthUsdOrderBookService> logger, ClientWebSocket clientWebSocket,
         IEthAskRepository ethAskRepository, IEthBidRepository ethBidRepository)
         : base(logger, clientWebSocket, CurrencyType.ethusd, "wss://ws.bitstamp.net")
-    {
-        _ethAskRepository = ethAskRepository;
-        _ethBidRepository = ethBidRepository;
-    }
+    {}
 
     public override async Task ExecuteOrderBook(OrderBook? message, CancellationToken cancellationToken = default)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Services/WebSockets/EthUsdOrderBookService.cs:25:9
 
     public override async Task ExecuteOrderBook(OrderBook? message, CancellationToken cancellationToken = default)
     {
-        await _ethAskRepository.InsertOrUpdateRangeAsync(new EthAsk().Convert(message!).ToList(), cancellationToken);
+        ;
         await _ethBidRepository.InsertOrUpdateRangeAsync(new EthBid().Convert(message!).ToList(), cancellationToken);
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Statement mutation
Services/WebSockets/EthUsdOrderBookService.cs:26:9
     public override async Task ExecuteOrderBook(OrderBook? message, CancellationToken cancellationToken = default)
     {
         await _ethAskRepository.InsertOrUpdateRangeAsync(new EthAsk().Convert(message!).ToList(), cancellationToken);
-        await _ethBidRepository.InsertOrUpdateRangeAsync(new EthBid().Convert(message!).ToList(), cancellationToken);
+        ;
     }
 }
