[Killed] Block removal mutation
BaseStartup.cs:15:5
     private readonly IConfiguration _configuration;
 
     protected BaseStartup(IConfiguration configuration)
-    {
-        _configuration = configuration;
-    }
+    {}
 
     public virtual void ConfigureServices(IServiceCollection services)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
BaseStartup.cs:21:9
 
     public virtual void ConfigureServices(IServiceCollection services)
     {
-        services.AddScoped<ICorrelationContextService, CorrelationContextService>();
+        ;
 
         services
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy

[Killed] Statement mutation
BaseStartup.cs:23:9
     {
         services.AddScoped<ICorrelationContextService, CorrelationContextService>();
 
-        services
-            .HealthChecksConfiguration(_configuration)
-            .AddDbContext(_configuration)
-            .AddDomainServices();
+        ;
     }
 }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy
