[Survived] String mutation
ConfigsExtensions/HealthCheckConfigurationExtension.cs:16:45
     public static IApplicationBuilder HealthCheckConfiguration(this IApplicationBuilder app)
     {
         return app
-            .UseHealthChecks(new PathString("/liveness"), new HealthCheckOptions
+            .UseHealthChecks(new PathString(""), new HealthCheckOptions
             {
                 Predicate = r => r.Name.Contains("self"),

[NoCoverage] String mutation
ConfigsExtensions/HealthCheckConfigurationExtension.cs:18:50
         return app
             .UseHealthChecks(new PathString("/liveness"), new HealthCheckOptions
             {
-                Predicate = r => r.Name.Contains("self"),
+                Predicate = r => r.Name.Contains(""),
                 ResponseWriter = UIResponseWriter.WriteHealthCheckUIResponse
             })

[Killed] Statement mutation
ConfigsExtensions/HealthCheckConfigurationExtension.cs:32:9
         IConfiguration configuration)
     {
         var health = services.AddHealthChecks();
-        health
-            .AddCheck(
-                "self",
-                () => HealthCheckResult.Healthy(),
-                new[] { "self", "readiness" })
-            .AddCheck(
-                "readiness",
-                () => HealthCheckResult.Healthy())
-            .AddSqlServer(
-                configuration.GetConnectionString("SqlServer")!,
-                tags: new[] { "Sql Server", "readiness" })
-            .AddRabbitMQ();
+        ;
 
         return services;
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] String mutation
ConfigsExtensions/HealthCheckConfigurationExtension.cs:36:25
             .AddCheck(
                 "self",
                 () => HealthCheckResult.Healthy(),
-                new[] { "self", "readiness" })
+                new[] { "", "readiness" })
             .AddCheck(
                 "readiness",
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] String mutation
ConfigsExtensions/HealthCheckConfigurationExtension.cs:42:31
                 () => HealthCheckResult.Healthy())
             .AddSqlServer(
                 configuration.GetConnectionString("SqlServer")!,
-                tags: new[] { "Sql Server", "readiness" })
+                tags: new[] { "", "readiness" })
             .AddRabbitMQ();
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
