[Killed] Statement mutation
ConfigsExtensions/ServicesConfigExtensions.cs:14:9
 {
     public static void AddDomainServices(this IServiceCollection services)
     {
-        services.AddTransient<IBtcUsdOrderBookService, BtcUsdOrderBookService>()
-            .AddTransient<IEthUsdOrderBookService, EthUsdOrderBookService>()
-            .AddScoped<IRequestOrderService, RequestOrderService>()
-            .AddScoped<IRepositoryFabric, RepositoryFabric>();
+        ;
     }
 }
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy
