[Killed] Statement mutation
Databases/SqlServers/BitstampData/BitstampContext.cs:26:9
 
     protected override void OnModelCreating(ModelBuilder modelBuilder)
     {
-        modelBuilder.ApplyConfigurationsFromAssembly(typeof(EthBidEntityConfiguration).Assembly);
+        ;
 
         modelBuilder.Ignore<Metric>();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Databases/SqlServers/BitstampData/BitstampContext.cs:28:9
     {
         modelBuilder.ApplyConfigurationsFromAssembly(typeof(EthBidEntityConfiguration).Assembly);
 
-        modelBuilder.Ignore<Metric>();
+        ;
         modelBuilder.Ignore<OrderItem>();
         modelBuilder.Entity<Metric>().HasNoKey();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Databases/SqlServers/BitstampData/BitstampContext.cs:29:9
         modelBuilder.ApplyConfigurationsFromAssembly(typeof(EthBidEntityConfiguration).Assembly);
 
         modelBuilder.Ignore<Metric>();
-        modelBuilder.Ignore<OrderItem>();
+        ;
         modelBuilder.Entity<Metric>().HasNoKey();
         modelBuilder.Entity<OrderItem>().HasNoKey();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Databases/SqlServers/BitstampData/BitstampContext.cs:30:9
 
         modelBuilder.Ignore<Metric>();
         modelBuilder.Ignore<OrderItem>();
-        modelBuilder.Entity<Metric>().HasNoKey();
+        ;
         modelBuilder.Entity<OrderItem>().HasNoKey();
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Databases/SqlServers/BitstampData/BitstampContext.cs:31:9
         modelBuilder.Ignore<Metric>();
         modelBuilder.Ignore<OrderItem>();
         modelBuilder.Entity<Metric>().HasNoKey();
-        modelBuilder.Entity<OrderItem>().HasNoKey();
+        ;
     }
 }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
