[NoCoverage] Statement mutation
Databases/SqlServers/BitstampData/BitstampDesignContext.cs:12:9
     {
         var optionsBuilder = new DbContextOptionsBuilder<BitstampContext>();
 
-        optionsBuilder.UseSqlServer(
-            "Data Source=(localdb)\\MsSqlLocalDb;initial catalog=ProductsDbDev;Integrated Security=True; MultipleActiveResultSets=True");
+        ;
 
         return new BitstampContext(optionsBuilder.Options);
