[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:11:9
 {
     public void Configure(EntityTypeBuilder<BtcAsk> builder)
     {
-        builder.HasKey(p => p.Id);
+        ;
         builder.Property(p => p.Id).ValueGeneratedOnAdd();
         builder.Property(p => p.Amount).HasPrecision(18, 8);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:12:9
     public void Configure(EntityTypeBuilder<BtcAsk> builder)
     {
         builder.HasKey(p => p.Id);
-        builder.Property(p => p.Id).ValueGeneratedOnAdd();
+        ;
         builder.Property(p => p.Amount).HasPrecision(18, 8);
         builder.Property(p => p.Price).HasPrecision(18, 2);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:13:9
     {
         builder.HasKey(p => p.Id);
         builder.Property(p => p.Id).ValueGeneratedOnAdd();
-        builder.Property(p => p.Amount).HasPrecision(18, 8);
+        ;
         builder.Property(p => p.Price).HasPrecision(18, 2);
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:14:9
         builder.HasKey(p => p.Id);
         builder.Property(p => p.Id).ValueGeneratedOnAdd();
         builder.Property(p => p.Amount).HasPrecision(18, 8);
-        builder.Property(p => p.Price).HasPrecision(18, 2);
+        ;
 
         builder.HasIndex(p => p.InsertAt);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:16:9
         builder.Property(p => p.Amount).HasPrecision(18, 8);
         builder.Property(p => p.Price).HasPrecision(18, 2);
 
-        builder.HasIndex(p => p.InsertAt);
+        ;
         builder.HasIndex(p => p.Price);
         builder.HasIndex(p => p.Amount);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:17:9
         builder.Property(p => p.Price).HasPrecision(18, 2);
 
         builder.HasIndex(p => p.InsertAt);
-        builder.HasIndex(p => p.Price);
+        ;
         builder.HasIndex(p => p.Amount);
         builder.HasIndex(p => p.Microtimestamp);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:18:9
 
         builder.HasIndex(p => p.InsertAt);
         builder.HasIndex(p => p.Price);
-        builder.HasIndex(p => p.Amount);
+        ;
         builder.HasIndex(p => p.Microtimestamp);
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:19:9
         builder.HasIndex(p => p.InsertAt);
         builder.HasIndex(p => p.Price);
         builder.HasIndex(p => p.Amount);
-        builder.HasIndex(p => p.Microtimestamp);
+        ;
 
         builder.HasIndex(p => new { p.Amount, p.Price }).IsUnique();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/BtcAskEntityConfiguration.cs:21:9
         builder.HasIndex(p => p.Amount);
         builder.HasIndex(p => p.Microtimestamp);
 
-        builder.HasIndex(p => new { p.Amount, p.Price }).IsUnique();
+        ;
     }
 }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
