[Killed] Statement mutation
SqlServers/BitstampData/Configurations/OrderEntityConfiguration.cs:17:9
         builder.Property(p => p.Id).ValueGeneratedOnAdd();
         builder.Property(p => p.Amount).HasPrecision(18, 8);
         builder.Property(p => p.Price).HasPrecision(18, 2);
-        builder.Property(p => p.Type).HasConversion<string>();
+        ;
         builder.Property(p => p.Crypto).HasConversion<string>();
         builder.Property(p => p.AmountTotal).HasPrecision(18, 8);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/OrderEntityConfiguration.cs:18:9
         builder.Property(p => p.Amount).HasPrecision(18, 8);
         builder.Property(p => p.Price).HasPrecision(18, 2);
         builder.Property(p => p.Type).HasConversion<string>();
-        builder.Property(p => p.Crypto).HasConversion<string>();
+        ;
         builder.Property(p => p.AmountTotal).HasPrecision(18, 8);
         builder.Property(p => p.Stock).HasConversion(
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/OrderEntityConfiguration.cs:19:9
         builder.Property(p => p.Price).HasPrecision(18, 2);
         builder.Property(p => p.Type).HasConversion<string>();
         builder.Property(p => p.Crypto).HasConversion<string>();
-        builder.Property(p => p.AmountTotal).HasPrecision(18, 8);
+        ;
         builder.Property(p => p.Stock).HasConversion(
                 attr => JsonConvert.SerializeObject(attr),
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Configurations/OrderEntityConfiguration.cs:20:9
         builder.Property(p => p.Type).HasConversion<string>();
         builder.Property(p => p.Crypto).HasConversion<string>();
         builder.Property(p => p.AmountTotal).HasPrecision(18, 8);
-        builder.Property(p => p.Stock).HasConversion(
-                attr => JsonConvert.SerializeObject(attr),
-                json => JsonConvert.DeserializeObject<OrderItem[]>(json)
-            );
+        ;
 
         builder.HasIndex(p => p.InsertAt);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
