[Killed] Statement mutation
SqlServers/BitstampData/Extensions/IncludeDbConnection.cs:16:9
     public static IServiceCollection AddDbContext(this IServiceCollection serviceCollection,
         IConfiguration configuration)
     {
-        serviceCollection
-            .AddDbContext<BitstampContext>(options =>
-                options.UseSqlServer(configuration.GetConnectionString("SqlServer")), ServiceLifetime.Transient)
-            .AddRepositories();
+        ;
 
         return serviceCollection;
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Extensions/IncludeDbConnection.cs:26:9
 
     private static void AddRepositories(this IServiceCollection serviceCollection)
     {
-        serviceCollection.TryAddScoped<IEthAskRepository, EthAskRepository>();
+        ;
         serviceCollection.TryAddScoped<IEthBidRepository, EthBidRepository>();
         serviceCollection.TryAddScoped<IBtcAskRepository, BtcAskRepository>();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Extensions/IncludeDbConnection.cs:27:9
     private static void AddRepositories(this IServiceCollection serviceCollection)
     {
         serviceCollection.TryAddScoped<IEthAskRepository, EthAskRepository>();
-        serviceCollection.TryAddScoped<IEthBidRepository, EthBidRepository>();
+        ;
         serviceCollection.TryAddScoped<IBtcAskRepository, BtcAskRepository>();
         serviceCollection.TryAddScoped<IBtcBidRepository, BtcBidRepository>();
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Extensions/IncludeDbConnection.cs:28:9
     {
         serviceCollection.TryAddScoped<IEthAskRepository, EthAskRepository>();
         serviceCollection.TryAddScoped<IEthBidRepository, EthBidRepository>();
-        serviceCollection.TryAddScoped<IBtcAskRepository, BtcAskRepository>();
+        ;
         serviceCollection.TryAddScoped<IBtcBidRepository, BtcBidRepository>();
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Extensions/IncludeDbConnection.cs:29:9
         serviceCollection.TryAddScoped<IEthAskRepository, EthAskRepository>();
         serviceCollection.TryAddScoped<IEthBidRepository, EthBidRepository>();
         serviceCollection.TryAddScoped<IBtcAskRepository, BtcAskRepository>();
-        serviceCollection.TryAddScoped<IBtcBidRepository, BtcBidRepository>();
+        ;
     }
 
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
SqlServers/BitstampData/Extensions/IncludeDbConnection.cs:36:9
     {
         using var serviceScope = app.ApplicationServices.GetRequiredService<IServiceScopeFactory>().CreateScope();
         var dbContext = serviceScope.ServiceProvider.GetRequiredService<BitstampContext>();
-        dbContext.Database.EnsureCreated();
+        ;
     }
 }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
