[Killed] Block removal mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:15:5
     private readonly DbSet<TEntity> _dbSet;
 
     protected BitstampRepository(BitstampContext BitstampContext)
-    {
-        _context = BitstampContext;
-        _dbSet = _context.Set<TEntity>();
-    }
+    {}
 
     public async Task InsertOrUpdateRangeAsync(List<IEntity> entities, CancellationToken cancellationToken)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:26:45
         var timestamp = entities.First().Timestamp;
         var microtimestamp = entities.First().Microtimestamp;
 
-        for (int i = 0; i < entities.Count; i++)
+        for (int i = 0; i < entities.Count; i--)
         {
             TEntity e = (TEntity)entities[i];

[NoCoverage] Equality mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:26:25
         var timestamp = entities.First().Timestamp;
         var microtimestamp = entities.First().Microtimestamp;
 
-        for (int i = 0; i < entities.Count; i++)
+        for (int i = 0; i <= entities.Count; i++)
         {
             TEntity e = (TEntity)entities[i];

[NoCoverage] Logical mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:29:60
         for (int i = 0; i < entities.Count; i++)
         {
             TEntity e = (TEntity)entities[i];
-            var en = await _dbSet.FirstOrDefaultAsync(a => a.Amount == e.Amount && a.Price == e.Price, cancellationToken);
+            var en = await _dbSet.FirstOrDefaultAsync(a => a.Amount == e.Amount || a.Price == e.Price, cancellationToken);
             if (en != null)
             {

[NoCoverage] Equality mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:29:84
         for (int i = 0; i < entities.Count; i++)
         {
             TEntity e = (TEntity)entities[i];
-            var en = await _dbSet.FirstOrDefaultAsync(a => a.Amount == e.Amount && a.Price == e.Price, cancellationToken);
+            var en = await _dbSet.FirstOrDefaultAsync(a => a.Amount == e.Amount && a.Price != e.Price, cancellationToken);
             if (en != null)
             {

[NoCoverage] Equality mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:30:17
         {
             TEntity e = (TEntity)entities[i];
             var en = await _dbSet.FirstOrDefaultAsync(a => a.Amount == e.Amount && a.Price == e.Price, cancellationToken);
-            if (en != null)
+            if (en == null)
             {
                 var up = en.UpdateTimeStamp(timestamp, microtimestamp);

[NoCoverage] Statement mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:33:17
             if (en != null)
             {
                 var up = en.UpdateTimeStamp(timestamp, microtimestamp);
-                _context.Update(up);
+                ;
                 entities.RemoveAll(a => up.Amount == a.Amount && up.Price == a.Price);
                 i--;

[NoCoverage] Statement mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:34:17
             {
                 var up = en.UpdateTimeStamp(timestamp, microtimestamp);
                 _context.Update(up);
-                entities.RemoveAll(a => up.Amount == a.Amount && up.Price == a.Price);
+                ;
                 i--;
             }

[NoCoverage] Equality mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:34:41
             {
                 var up = en.UpdateTimeStamp(timestamp, microtimestamp);
                 _context.Update(up);
-                entities.RemoveAll(a => up.Amount == a.Amount && up.Price == a.Price);
+                entities.RemoveAll(a => up.Amount != a.Amount && up.Price == a.Price);
                 i--;
             }

[NoCoverage] Statement mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:35:17
                 var up = en.UpdateTimeStamp(timestamp, microtimestamp);
                 _context.Update(up);
                 entities.RemoveAll(a => up.Amount == a.Amount && up.Price == a.Price);
-                i--;
+                ;
             }
         }

[NoCoverage] PostDecrementExpression to PostIncrementExpression mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:35:17
                 var up = en.UpdateTimeStamp(timestamp, microtimestamp);
                 _context.Update(up);
                 entities.RemoveAll(a => up.Amount == a.Amount && up.Price == a.Price);
-                i--;
+                i++;
             }
         }

[NoCoverage] Statement mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:38:9
                 i--;
             }
         }
-        await _context.BulkInsertAsync(entities, cancellationToken: cancellationToken);
+        ;
         await _context.SaveChangesAsync(cancellationToken);
         await transaction.CommitAsync(cancellationToken);

[NoCoverage] Statement mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:39:9
             }
         }
         await _context.BulkInsertAsync(entities, cancellationToken: cancellationToken);
-        await _context.SaveChangesAsync(cancellationToken);
+        ;
         await transaction.CommitAsync(cancellationToken);
     }

[NoCoverage] Statement mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:40:9
         }
         await _context.BulkInsertAsync(entities, cancellationToken: cancellationToken);
         await _context.SaveChangesAsync(cancellationToken);
-        await transaction.CommitAsync(cancellationToken);
+        ;
     }
 

[Killed] String mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:49:13
 
         var cteQuery = await _context.Metrics
             .FromSqlRaw(
-            $@"WITH cte AS (SELECT TOP 100 Id,
-                                        InsertAt,
-                                        [Timestamp],
-                                        Microtimestamp,
-                                        Price,
-                                        Amount
-                        FROM Bitstamp.dbo.{tableName} WITH (NOLOCK)
-                        ORDER BY InsertAt DESC)
-            SELECT top 1 MIN(Price)         AS minPrice,
-                    MAX(Price)         AS maxPrice,
-                    AVG(Amount)        AS mediaAmount,
-                    AVG(Price)         AS mediaPrice,
-                    (SELECT AVG(Price) AS mediaPrice5
-                    FROM Bitstamp.dbo.{tableName} WITH (NOLOCK)
-                        WHERE InsertAt >= (SELECT TOP 1 DATEADD(second, -5, MAX(InsertAt)) FROM cte)) AS mediaPrice5
-            FROM cte
-            OPTION (RECOMPILE)")
+            $"")
         .AsNoTracking()
         .ToListAsync(cancellationToken);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
SqlServers/BitstampData/Repositories/BitstampRepository.cs:69:16
         .AsNoTracking()
         .ToListAsync(cancellationToken);
 
-        return cteQuery.FirstOrDefault();
+        return cteQuery.First();
     }
 

[NoCoverage] Linq method mutation (Take() to Skip())
SqlServers/BitstampData/Repositories/BitstampRepository.cs:74:28
 
     public async Task<List<OrderItem>> ListItensBookToOrder(decimal amount, CancellationToken cancellationToken)
     {
-        var exists = await _dbSet.Where(x => x.Amount == amount)
-            .OrderByDescending(x => x.Microtimestamp)
-            .Take(1)
-            .Select(x => new OrderItem(x.Amount, x.Price, x.InsertAt))
-            .ToListAsync(cancellationToken);
+        var exists = await _dbSet.Where(x => x.Amount == amount)
+            .OrderByDescending(x => x.Microtimestamp)
+            .Skip(1)
+            .Select(x => new OrderItem(x.Amount, x.Price, x.InsertAt))
+            .ToListAsync(cancellationToken);
 
         if (exists.Any())

[NoCoverage] Linq method mutation (OrderByDescending() to OrderBy())
SqlServers/BitstampData/Repositories/BitstampRepository.cs:74:28
 
     public async Task<List<OrderItem>> ListItensBookToOrder(decimal amount, CancellationToken cancellationToken)
     {
-        var exists = await _dbSet.Where(x => x.Amount == amount)
-            .OrderByDescending(x => x.Microtimestamp)
-            .Take(1)
-            .Select(x => new OrderItem(x.Amount, x.Price, x.InsertAt))
-            .ToListAsync(cancellationToken);
+        var exists = await _dbSet.Where(x => x.Amount == amount)
+            .OrderBy(x => x.Microtimestamp)
+            .Take(1)
+            .Select(x => new OrderItem(x.Amount, x.Price, x.InsertAt))
+            .ToListAsync(cancellationToken);
 
         if (exists.Any())

[NoCoverage] Negate expression
SqlServers/BitstampData/Repositories/BitstampRepository.cs:80:13
             .Select(x => new OrderItem(x.Amount, x.Price, x.InsertAt))
             .ToListAsync(cancellationToken);
 
-        if (exists.Any())
+        if (!(exists.Any()))
             return exists;
 

[NoCoverage] Negate expression
SqlServers/BitstampData/Repositories/BitstampRepository.cs:84:25
             return exists;
 
         var tableName = _context.Model.FindEntityType(typeof(TEntity))!.GetTableName();
-        var ascOrDesc = tableName!.Contains("Bid", StringComparison.InvariantCultureIgnoreCase) ? "desc" : "asc";
+        var ascOrDesc = !(tableName!.Contains("Bid", StringComparison.InvariantCultureIgnoreCase) ) ? "desc" : "asc";
        
         var cteQuery = await _context.OrderItems.FromSqlRaw(

[NoCoverage] String mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:87:9
         var ascOrDesc = tableName!.Contains("Bid", StringComparison.InvariantCultureIgnoreCase) ? "desc" : "asc";
        
         var cteQuery = await _context.OrderItems.FromSqlRaw(
-        $@"SELECT Amount, Price, InsertAt
-        FROM (
-            SELECT InsertAt, Price, Amount,
-                SUM(Amount) OVER (ORDER BY Amount ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_sum
-            FROM Bitstamp.dbo.{tableName}
-        ) AS subquery
-        WHERE running_sum <= {amount}
-        ORDER BY Price {ascOrDesc}, InsertAt DESC
-        OPTION (RECOMPILE)").AsNoTracking().ToListAsync(cancellationToken);
+        $"").AsNoTracking().ToListAsync(cancellationToken);
 
         return cteQuery;

[NoCoverage] Statement mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:102:9
 
     public async Task SaveOrder(Order order, CancellationToken cancellationToken)
     {
-        await _context.Orders.AddAsync(order, cancellationToken);
+        ;
         await _context.SaveChangesAsync(cancellationToken);
     }

[NoCoverage] Statement mutation
SqlServers/BitstampData/Repositories/BitstampRepository.cs:103:9
     public async Task SaveOrder(Order order, CancellationToken cancellationToken)
     {
         await _context.Orders.AddAsync(order, cancellationToken);
-        await _context.SaveChangesAsync(cancellationToken);
+        ;
     }
 }
