[Killed] Block removal mutation
Middlewares/CorrelationMiddleware.cs:12:5
     private readonly RequestDelegate _next;
 
     public CorrelationMiddleware(RequestDelegate next)
-    {
-        _next = next;
-    }
+    {}
 
     public async Task Invoke(HttpContext httpContext)
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy

[Killed] Linq method mutation (FirstOrDefault() to First())
Middlewares/CorrelationMiddleware.cs:20:67
     {
         var correlationContext = httpContext.RequestServices.GetRequiredService<ICorrelationContextService>();
         var crId = httpContext.Request.Headers.TryGetValue("X-Correlation-ID", out var value);
-        correlationContext.SetCorrelationId(crId && Guid.TryParse(value.FirstOrDefault(), out var correlationGuid) ? correlationGuid : Guid.NewGuid());
+        correlationContext.SetCorrelationId(crId && Guid.TryParse(value.First(), out var correlationGuid) ? correlationGuid : Guid.NewGuid());
 
         if (!crId)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Middlewares/CorrelationMiddleware.cs:22:13
         var crId = httpContext.Request.Headers.TryGetValue("X-Correlation-ID", out var value);
         correlationContext.SetCorrelationId(crId && Guid.TryParse(value.FirstOrDefault(), out var correlationGuid) ? correlationGuid : Guid.NewGuid());
 
-        if (!crId)
+        if (crId)
             httpContext.Request.Headers.Add("X-Correlation-ID", correlationContext.GetCorrelationId().ToString());
 
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy; UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy

[NoCoverage] Statement mutation
Middlewares/CorrelationMiddleware.cs:23:13
         correlationContext.SetCorrelationId(crId && Guid.TryParse(value.FirstOrDefault(), out var correlationGuid) ? correlationGuid : Guid.NewGuid());
 
         if (!crId)
-            httpContext.Request.Headers.Add("X-Correlation-ID", correlationContext.GetCorrelationId().ToString());
+            ;
 
         await _next(httpContext);

[Survived] Statement mutation
Middlewares/CorrelationMiddleware.cs:25:9
         if (!crId)
             httpContext.Request.Headers.Add("X-Correlation-ID", correlationContext.GetCorrelationId().ToString());
 
-        await _next(httpContext);
+        ;
     }
 }
