[Killed] Block removal mutation
Middlewares/LoggingMiddleware.cs:15:5
     private readonly RecyclableMemoryStreamManager _recyclableMemoryStreamManager;
 
     public LoggingMiddleware(RequestDelegate next, ILoggerFactory loggerFactory)
-    {
-        _next = next;
-        _logger = loggerFactory
-            .CreateLogger<LoggingMiddleware>();
-        _recyclableMemoryStreamManager = new RecyclableMemoryStreamManager();
-    }
+    {}
 
     public async Task Invoke(HttpContext context)
killedBy: UnitTest.IntegratedTests.WebApi.OrderControllerTests.Buy

[Killed] Negate expression
Middlewares/LoggingMiddleware.cs:24:13
 
     public async Task Invoke(HttpContext context)
     {
-        if (context.Request.Path.Value!.Contains("swagger"))
+        if (!(context.Request.Path.Value!.Contains("swagger")))
         {
             await _next(context);
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Statement mutation
Middlewares/LoggingMiddleware.cs:26:13
     {
         if (context.Request.Path.Value!.Contains("swagger"))
         {
-            await _next(context);
+            ;
         }
         else

[Killed] Statement mutation
Middlewares/LoggingMiddleware.cs:30:13
         }
         else
         {
-            await LogRequest(context);
+            ;
             await LogResponse(context);
         }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Survived] Statement mutation
Middlewares/LoggingMiddleware.cs:31:13
         else
         {
             await LogRequest(context);
-            await LogResponse(context);
+            ;
         }
     }

[Survived] Statement mutation
Middlewares/LoggingMiddleware.cs:40:9
         var originalBodyStream = context.Response.Body;
         await using var responseBody = _recyclableMemoryStreamManager.GetStream();
         context.Response.Body = responseBody;
-        await _next(context);
+        ;
         context.Response.Body.Seek(0, SeekOrigin.Begin);
 

[Survived] Statement mutation
Middlewares/LoggingMiddleware.cs:41:9
         await using var responseBody = _recyclableMemoryStreamManager.GetStream();
         context.Response.Body = responseBody;
         await _next(context);
-        context.Response.Body.Seek(0, SeekOrigin.Begin);
+        ;
 
         using var t = LogContext.PushProperty("X-Correlation-ID", context.Request.Headers["X-Correlation-ID"]);

[Survived] Statement mutation
Middlewares/LoggingMiddleware.cs:44:9
         context.Response.Body.Seek(0, SeekOrigin.Begin);
 
         using var t = LogContext.PushProperty("X-Correlation-ID", context.Request.Headers["X-Correlation-ID"]);
-        _logger.LogInformation(
-            "Http Response Information | Schema:{RequestScheme} Method:{Method} Host:{RequestHost} Path:{RequestPath} QueryString: {RequestQueryString} Headers:{Join}",
-            context.Request.Scheme, context.Request.Host, context.Request.Method, context.Request.Path,
-            context.Request.QueryString,
-            string.Join(", ", context.Request.Headers.Select(h => $"{h.Key}: {h.Value}")));
+        ;
         await responseBody.CopyToAsync(originalBodyStream);
     }

[Survived] Statement mutation
Middlewares/LoggingMiddleware.cs:49:9
             context.Request.Scheme, context.Request.Host, context.Request.Method, context.Request.Path,
             context.Request.QueryString,
             string.Join(", ", context.Request.Headers.Select(h => $"{h.Key}: {h.Value}")));
-        await responseBody.CopyToAsync(originalBodyStream);
+        ;
     }
 

[Killed] Statement mutation
Middlewares/LoggingMiddleware.cs:56:9
     {
         context.Request.EnableBuffering();
         await using var requestStream = _recyclableMemoryStreamManager.GetStream();
-        await context.Request.Body.CopyToAsync(requestStream);
+        ;
         var log =
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Statement mutation
Middlewares/LoggingMiddleware.cs:60:9
         var log =
         using var t = LogContext.PushProperty("X-Correlation-ID", context.Request.Headers["X-Correlation-ID"]);
-        _logger.LogInformation(log);
+        ;
         context.Request.Body.Position = 0;
     }
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test
