[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:13:13
         /// <inheritdoc />
         protected override void Up(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.CreateTable(
-                name: "BtcAsks",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
-                    Timestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_BtcAsks", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:17:81
                 name: "BtcAsks",
                 columns: table => new
                 {
-                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
+                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: true),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:17:51
                 name: "BtcAsks",
                 columns: table => new
                 {
-                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
+                    Id = table.Column<Guid>(type: "", nullable: false),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:18:95
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
+                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: true),
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),
                     Microtimestamp = table.Column<long>(type: "bigint", nullable: false),

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:19:78
                 {
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
-                    Timestamp = table.Column<long>(type: "bigint", nullable: false),
+                    Timestamp = table.Column<long>(type: "bigint", nullable: true),
                     Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:20:83
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
+                    Microtimestamp = table.Column<long>(type: "bigint", nullable: true),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
                     Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:21:109
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),
                     Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
+                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: true),
                     Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)
                 },

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:21:57
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),
                     Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
+                    Price = table.Column<decimal>(type: "", precision: 18, scale: 2, nullable: false),
                     Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)
                 },

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:22:110
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),
                     Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)
+                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:26:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_BtcAsks", x => x.Id);
+                    ;
                 });
 

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:26:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_BtcAsks", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:29:13
                     table.PrimaryKey("PK_BtcAsks", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "BtcBids",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
-                    Timestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_BtcBids", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:36:63
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
+                    Microtimestamp = table.Column<long>(type: "", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
                     Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:38:58
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),
                     Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)
+                    Amount = table.Column<decimal>(type: "", precision: 18, scale: 8, nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:42:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_BtcBids", x => x.Id);
+                    ;
                 });
 

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:42:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_BtcBids", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:45:13
                     table.PrimaryKey("PK_BtcBids", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "EthAsks",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
-                    Timestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_EthAsks", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:51:58
                 {
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
-                    Timestamp = table.Column<long>(type: "bigint", nullable: false),
+                    Timestamp = table.Column<long>(type: "", nullable: false),
                     Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:58:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_EthAsks", x => x.Id);
+                    ;
                 });
 

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:58:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_EthAsks", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:61:13
                     table.PrimaryKey("PK_EthAsks", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "EthBids",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
-                    Timestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Microtimestamp = table.Column<long>(type: "bigint", nullable: false),
-                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_EthBids", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:62:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "EthBids",
+                name: "",
                 columns: table => new
                 {

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:66:67
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
+                    InsertAt = table.Column<DateTimeOffset>(type: "", nullable: false),
                     Timestamp = table.Column<long>(type: "bigint", nullable: false),
                     Microtimestamp = table.Column<long>(type: "bigint", nullable: false),

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:74:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_EthBids", x => x.Id);
+                    ;
                 });
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:77:13
                     table.PrimaryKey("PK_EthBids", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "Orders",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
-                    Crypto = table.Column<string>(type: "nvarchar(max)", nullable: false),
-                    Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),
-                    Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
-                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    AmountTotal = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Orders", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:82:110
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
+                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: true),
                     Crypto = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:82:58
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
-                    Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
+                    Amount = table.Column<decimal>(type: "", precision: 18, scale: 8, nullable: false),
                     Crypto = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:83:84
                 {
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                     Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
-                    Crypto = table.Column<string>(type: "nvarchar(max)", nullable: false),
+                    Crypto = table.Column<string>(type: "nvarchar(max)", nullable: true),
                     Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Type = table.Column<string>(type: "nvarchar(max)", nullable: false),

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:84:83
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                     Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
                     Crypto = table.Column<string>(type: "nvarchar(max)", nullable: false),
-                    Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),
+                    Stock = table.Column<string>(type: "nvarchar(max)", nullable: true),
                     Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:84:56
                     Id = table.Column<Guid>(type: "uniqueidentifier", nullable: false),
                     Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
                     Crypto = table.Column<string>(type: "nvarchar(max)", nullable: false),
-                    Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),
+                    Stock = table.Column<string>(type: "", nullable: false),
                     Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:85:82
                     Amount = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
                     Crypto = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),
-                    Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
+                    Type = table.Column<string>(type: "nvarchar(max)", nullable: true),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
                     AmountTotal = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:86:109
                     Crypto = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
-                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
+                    Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: true),
                     AmountTotal = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false)

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:87:115
                     Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    AmountTotal = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
+                    AmountTotal = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: true),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false)
                 },

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:87:63
                     Stock = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
-                    AmountTotal = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
+                    AmountTotal = table.Column<decimal>(type: "", precision: 18, scale: 8, nullable: false),
                     InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false)
                 },

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:88:95
                     Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
                     AmountTotal = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false)
+                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:88:67
                     Type = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     Price = table.Column<decimal>(type: "decimal(18,2)", precision: 18, scale: 2, nullable: false),
                     AmountTotal = table.Column<decimal>(type: "decimal(18,8)", precision: 18, scale: 8, nullable: false),
-                    InsertAt = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false)
+                    InsertAt = table.Column<DateTimeOffset>(type: "", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:92:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Orders", x => x.Id);
+                    ;
                 });
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:95:13
                     table.PrimaryKey("PK_Orders", x => x.Id);
                 });
 
-            migrationBuilder.CreateIndex(
-                name: "IX_BtcAsks_Amount",
-                table: "BtcAsks",
-                column: "Amount");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:96:23
                 });
 
             migrationBuilder.CreateIndex(
-                name: "IX_BtcAsks_Amount",
+                name: "",
                 table: "BtcAsks",
                 column: "Amount");

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:100:13
                 table: "BtcAsks",
                 column: "Amount");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_BtcAsks_Amount_Price",
-                table: "BtcAsks",
-                columns: new[] { "Amount", "Price" },
-                unique: true);
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:102:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_BtcAsks_Amount_Price",
-                table: "BtcAsks",
+                table: "",
                 columns: new[] { "Amount", "Price" },
                 unique: true);

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:103:34
             migrationBuilder.CreateIndex(
                 name: "IX_BtcAsks_Amount_Price",
                 table: "BtcAsks",
-                columns: new[] { "Amount", "Price" },
+                columns: new[] { "", "Price" },
                 unique: true);
 

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:103:44
             migrationBuilder.CreateIndex(
                 name: "IX_BtcAsks_Amount_Price",
                 table: "BtcAsks",
-                columns: new[] { "Amount", "Price" },
+                columns: new[] { "Amount", "" },
                 unique: true);
 

[NoCoverage] Boolean mutation
Migrations/20230521023508_init.cs:104:25
                 name: "IX_BtcAsks_Amount_Price",
                 table: "BtcAsks",
                 columns: new[] { "Amount", "Price" },
-                unique: true);
+                unique: false);
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:106:13
                 columns: new[] { "Amount", "Price" },
                 unique: true);
 
-            migrationBuilder.CreateIndex(
-                name: "IX_BtcAsks_InsertAt",
-                table: "BtcAsks",
-                column: "InsertAt");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:108:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_BtcAsks_InsertAt",
-                table: "BtcAsks",
+                table: "",
                 column: "InsertAt");
 

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:109:25
             migrationBuilder.CreateIndex(
                 name: "IX_BtcAsks_InsertAt",
                 table: "BtcAsks",
-                column: "InsertAt");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:111:13
                 table: "BtcAsks",
                 column: "InsertAt");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_BtcAsks_Price",
-                table: "BtcAsks",
-                column: "Price");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:114:25
             migrationBuilder.CreateIndex(
                 name: "IX_BtcAsks_Price",
                 table: "BtcAsks",
-                column: "Price");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:116:13
                 table: "BtcAsks",
                 column: "Price");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_BtcBids_Amount",
-                table: "BtcBids",
-                column: "Amount");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:121:13
                 table: "BtcBids",
                 column: "Amount");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_BtcBids_Amount_Price",
-                table: "BtcBids",
-                columns: new[] { "Amount", "Price" },
-                unique: true);
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:124:34
             migrationBuilder.CreateIndex(
                 name: "IX_BtcBids_Amount_Price",
                 table: "BtcBids",
-                columns: new[] { "Amount", "Price" },
+                columns: new[] { "", "Price" },
                 unique: true);
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:127:13
                 columns: new[] { "Amount", "Price" },
                 unique: true);
 
-            migrationBuilder.CreateIndex(
-                name: "IX_BtcBids_InsertAt",
-                table: "BtcBids",
-                column: "InsertAt");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:128:23
                 unique: true);
 
             migrationBuilder.CreateIndex(
-                name: "IX_BtcBids_InsertAt",
+                name: "",
                 table: "BtcBids",
                 column: "InsertAt");

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:129:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_BtcBids_InsertAt",
-                table: "BtcBids",
+                table: "",
                 column: "InsertAt");
 
