[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:132:13
                 table: "BtcBids",
                 column: "InsertAt");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_BtcBids_Price",
-                table: "BtcBids",
-                column: "Price");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:133:23
                 column: "InsertAt");
 
             migrationBuilder.CreateIndex(
-                name: "IX_BtcBids_Price",
+                name: "",
                 table: "BtcBids",
                 column: "Price");

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:134:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_BtcBids_Price",
-                table: "BtcBids",
+                table: "",
                 column: "Price");
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:137:13
                 table: "BtcBids",
                 column: "Price");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_EthAsks_Amount",
-                table: "EthAsks",
-                column: "Amount");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:142:13
                 table: "EthAsks",
                 column: "Amount");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_EthAsks_Amount_Price",
-                table: "EthAsks",
-                columns: new[] { "Amount", "Price" },
-                unique: true);
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:144:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_EthAsks_Amount_Price",
-                table: "EthAsks",
+                table: "",
                 columns: new[] { "Amount", "Price" },
                 unique: true);

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:148:13
                 columns: new[] { "Amount", "Price" },
                 unique: true);
 
-            migrationBuilder.CreateIndex(
-                name: "IX_EthAsks_InsertAt",
-                table: "EthAsks",
-                column: "InsertAt");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:150:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_EthAsks_InsertAt",
-                table: "EthAsks",
+                table: "",
                 column: "InsertAt");
 

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:151:25
             migrationBuilder.CreateIndex(
                 name: "IX_EthAsks_InsertAt",
                 table: "EthAsks",
-                column: "InsertAt");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:153:13
                 table: "EthAsks",
                 column: "InsertAt");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_EthAsks_Price",
-                table: "EthAsks",
-                column: "Price");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:155:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_EthAsks_Price",
-                table: "EthAsks",
+                table: "",
                 column: "Price");
 

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:156:25
             migrationBuilder.CreateIndex(
                 name: "IX_EthAsks_Price",
                 table: "EthAsks",
-                column: "Price");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:158:13
                 table: "EthAsks",
                 column: "Price");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_EthBids_Amount",
-                table: "EthBids",
-                column: "Amount");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:159:23
                 column: "Price");
 
             migrationBuilder.CreateIndex(
-                name: "IX_EthBids_Amount",
+                name: "",
                 table: "EthBids",
                 column: "Amount");

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:160:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_EthBids_Amount",
-                table: "EthBids",
+                table: "",
                 column: "Amount");
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:163:13
                 table: "EthBids",
                 column: "Amount");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_EthBids_Amount_Price",
-                table: "EthBids",
-                columns: new[] { "Amount", "Price" },
-                unique: true);
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:166:44
             migrationBuilder.CreateIndex(
                 name: "IX_EthBids_Amount_Price",
                 table: "EthBids",
-                columns: new[] { "Amount", "Price" },
+                columns: new[] { "Amount", "" },
                 unique: true);
 

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:166:34
             migrationBuilder.CreateIndex(
                 name: "IX_EthBids_Amount_Price",
                 table: "EthBids",
-                columns: new[] { "Amount", "Price" },
+                columns: new[] { "", "Price" },
                 unique: true);
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:169:13
                 columns: new[] { "Amount", "Price" },
                 unique: true);
 
-            migrationBuilder.CreateIndex(
-                name: "IX_EthBids_InsertAt",
-                table: "EthBids",
-                column: "InsertAt");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:172:25
             migrationBuilder.CreateIndex(
                 name: "IX_EthBids_InsertAt",
                 table: "EthBids",
-                column: "InsertAt");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:174:13
                 table: "EthBids",
                 column: "InsertAt");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_EthBids_Price",
-                table: "EthBids",
-                column: "Price");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:175:23
                 column: "InsertAt");
 
             migrationBuilder.CreateIndex(
-                name: "IX_EthBids_Price",
+                name: "",
                 table: "EthBids",
                 column: "Price");

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:177:25
             migrationBuilder.CreateIndex(
                 name: "IX_EthBids_Price",
                 table: "EthBids",
-                column: "Price");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:179:13
                 table: "EthBids",
                 column: "Price");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_Orders_InsertAt",
-                table: "Orders",
-                column: "InsertAt");
+            ;
         }
 

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:188:13
         /// <inheritdoc />
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropTable(
-                name: "BtcAsks");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:191:13
             migrationBuilder.DropTable(
                 name: "BtcAsks");
 
-            migrationBuilder.DropTable(
-                name: "BtcBids");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:194:13
             migrationBuilder.DropTable(
                 name: "BtcBids");
 
-            migrationBuilder.DropTable(
-                name: "EthAsks");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:197:13
             migrationBuilder.DropTable(
                 name: "EthAsks");
 
-            migrationBuilder.DropTable(
-                name: "EthBids");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
Migrations/20230521023508_init.cs:198:23
                 name: "EthAsks");
 
             migrationBuilder.DropTable(
-                name: "EthBids");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Migrations/20230521023508_init.cs:200:13
             migrationBuilder.DropTable(
                 name: "EthBids");
 
-            migrationBuilder.DropTable(
-                name: "Orders");
+            ;
         }
     }
