[Killed] Block removal mutation
WebSockets/HostedServices/BtcUsdOrderBookHostedService.cs:13:5
     private readonly IBtcUsdOrderBookService _btcUsdOrderBookService;
 
     public BtcUsdOrderBookHostedService(ILogger<BtcUsdOrderBookHostedService> logger, IBtcUsdOrderBookService btcUsdOrderBookService)
-    {
-        _logger = logger;
-        _btcUsdOrderBookService = btcUsdOrderBookService;
-    }
+    {}
 
     protected override Task ExecuteAsync(CancellationToken stoppingToken)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Block removal mutation
WebSockets/HostedServices/BtcUsdOrderBookHostedService.cs:21:9
     protected override Task ExecuteAsync(CancellationToken stoppingToken)
     {
         try
-        {
-            return _btcUsdOrderBookService.ConnectAndListen();
-        }
+        {}
         catch (Exception e)
         {
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] Statement mutation
WebSockets/HostedServices/BtcUsdOrderBookHostedService.cs:26:13
         }
         catch (Exception e)
         {
-            _logger.LogError(e, "Erro BtcUsdOrderBookHostedService");
+            ;
             return Task.CompletedTask;
         }
