[Killed] Block removal mutation
WebSockets/HostedServices/EthUsdOrderBookHostedService.cs:13:5
     private readonly IEthUsdOrderBookService _ethUsdOrderBookService;
 
     public EthUsdOrderBookHostedService(ILogger<EthUsdOrderBookHostedService> logger, IEthUsdOrderBookService ethUsdOrderBookService)
-    {
-        _logger = logger;
-        _ethUsdOrderBookService = ethUsdOrderBookService;
-    }
+    {}
 
     protected override Task ExecuteAsync(CancellationToken stoppingToken)
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[Killed] Block removal mutation
WebSockets/HostedServices/EthUsdOrderBookHostedService.cs:21:9
     protected override Task ExecuteAsync(CancellationToken stoppingToken)
     {
         try
-        {
-            return _ethUsdOrderBookService.ConnectAndListen();
-        }
+        {}
         catch (Exception e)
         {
killedBy: UnitTest.IntegratedTests.HostedServicesClientTests.Tests.Test

[NoCoverage] String mutation
WebSockets/HostedServices/EthUsdOrderBookHostedService.cs:26:33
         }
         catch (Exception e)
         {
-            _logger.LogError(e, "Erro BtcUsdOrderBookHostedService");
+            _logger.LogError(e, "");
             return Task.CompletedTask;
         }
